{"data": [{"name": "Photonic Chip-Scale Interconnection Networks for Performance-Energy Optimized Computing", "category": 4}, {"name": "Semiconductor Industry - Perspective, Evolution and Challenges", "category": 5}, {"name": "Comparing Energy and Latency of Asynchronous and Synchronous NoCs for Embedded SoCs", "category": 0}, {"name": "Traffic- and Thermal-Aware Run-Time Thermal Management Scheme for 3D NoC Systems", "category": 6}, {"name": "A Network Congestion-Aware Memory Controller", "category": 3}, {"name": "Design of High-Radix Clos Network-on-Chip", "category": 3}, {"name": "A Low-Overhead Asynchronous Interconnection Network for GALS Chip Multiprocessors", "category": 0}, {"name": "Hierarchical Network-on-Chip for Embedded Many-Core Architectures", "category": 6}, {"name": "Asynchronous Bypass Channels - Improving Performance for Multi-synchronous NoCs", "category": 0}, {"name": "Back Suction - Service Guarantees for Latency-Sensitive On-chip Networks", "category": 4}, {"name": "Physical vs. Virtual Express Topologies with Low-Swing Links for Future Many-Core NoCs", "category": 4}, {"name": "Performance Evaluation of a Multicore System with Optically Connected Memory Modules", "category": 1}, {"name": "Power-Efficient and High-Performance Multi-level Hybrid Nanophotonic Interconnect for Multicores", "category": 2}, {"name": "Evaluating Bufferless Flow Control for On-chip Networks", "category": 1}, {"name": "Physical-Aware Link Allocation and Route Assignment for Chip Multiprocessing", "category": 0}, {"name": "Impact of Half-Duplex and Full-Duplex DMA Implementations on NoC Performance", "category": 2}, {"name": "Ultra Fine-Grained Run-Time Power Gating of On-chip Routers for CMPs", "category": 4}, {"name": "A Low-Latency and Memory-Efficient On-chip Network", "category": 2}, {"name": "Low-Power Bioelectronics for Massively Parallel Neuromonitoring", "category": 3}, {"name": "Fault-Tolerant Flow Control in On-chip Networks", "category": 1}, {"name": "A 128 x 128 x 24Gb/s Crossbar Interconnecting 128 Tiles in a Single Hop and Occupying 6% of Their Area", "category": 6}, {"name": "Keynote 3 (Banquet Talk) Digital space", "category": 0}, {"name": "Network-on-Chip Architectures for Neural Networks", "category": 2}, {"name": "QuaLe - A Quantum-Leap Inspired Model for Non-stationary Analysis of NoC Traffic in Chip Multi-processors", "category": 3}, {"name": "Transient and Permanent Error Co-management Method for Reliable Networks-on-Chip", "category": 3}, {"name": "Temperature-Aware Delay Borrowing for Energy-Efficient Low-Voltage Link Design", "category": 4}, {"name": "A Low-Cost Deadlock-Free Design of Minimal-Table Rerouted XY-Routing for Irregular Wireless NoCs", "category": 4}, {"name": "Flow-aware allocation for on-chip networks", "category": 5}, {"name": "NoCs - It is about the memory and the programming model", "category": 5}, {"name": "Power reduction through physical placement of asynchronous routers", "category": 1}, {"name": "Improved Utilization of NoC Channel Bandwidth by Switch Replication for Cost-Effective Multi-processor Systems-on-Chip", "category": 3}, {"name": "NoC's at the center of chip architecture - Urgent needs (today) and what they must become (future)", "category": 0}, {"name": "The design of a latency constrained, power optimized NoC for a 4G SoC", "category": 5}, {"name": "Addressing Manufacturing Challenges with Cost-Efficient Fault Tolerant Routing", "category": 5}, {"name": "Comparison of Deadlock Recovery and Avoidance Mechanisms to Approach Message Dependent Deadlocks in On-chip Networks", "category": 3}, {"name": "Improving the Performance of GALS-Based NoCs in the Presence of Process Variation", "category": 2}, {"name": "A Modeling and exploration framework for interconnect network design in the nanometer era", "category": 6}, {"name": "Lookahead-based adaptive voltage scheme for energy-efficient on-chip interconnect links", "category": 5}, {"name": "Increasing NoC power estimation accuracy through a rate-based model", "category": 4}, {"name": "Connection-centric network for spiking neural networks", "category": 0}, {"name": "Energy efficient application mapping to NoC processing elements operating at multiple voltage levels", "category": 0}, {"name": "A Communication and configuration controller for NoC based reconfigurable data flow architecture", "category": 4}, {"name": "Performance Evaluation of NoC Architectures for Parallel Workloads", "category": 3}, {"name": "Silicon-photonic clos networks for global on-chip communication", "category": 1}, {"name": "On-Chip photonic interconnects for scalable multi-core architectures", "category": 3}, {"name": "Design of a High-Throughput Distributed Shared-Buffer NoC Router", "category": 2}, {"name": "HiRA - A methodology for deadlock free routing in hierarchical networks on chip", "category": 5}, {"name": "Contention-free on-chip routing of optical packets", "category": 0}, {"name": "Using adaptive routing to compensate for performance heterogeneity", "category": 0}, {"name": "Dynamic packet fragmentation for increased virtual channel utilization in on-chip routers", "category": 1}, {"name": "Fault-tolerant architecture and deflection routing for degradable NoC switches", "category": 6}, {"name": "BiNoC - A bidirectional NoC architecture with dynamic self-reconfigurable channel", "category": 1}, {"name": "Exploring concentration and channel slicing in on-chip network router", "category": 2}, {"name": "A modular synchronizing FIFO for NoCs", "category": 0}, {"name": "Best of both worlds - A bus enhanced NoC (BENoC)", "category": 6}, {"name": "CTC - An end-to-end flow control protocol for multi-core systems-on-chip", "category": 6}, {"name": "Static virtual channel allocation in oblivious routing", "category": 4}, {"name": "Packet-level static timing analysis for NoCs", "category": 0}, {"name": "Analysis of worst-case delay bounds for best-effort communication in wormhole networks on chip", "category": 5}, {"name": "Diagnosis of interconnect shorts in mesh NoCs", "category": 1}, {"name": "Performance and power efficient on-chip communication using adaptive virtual point-to-point connections", "category": 0}, {"name": "Statistical Approach to NoC Design", "category": 1}, {"name": "A Network of Time-Division Multiplexed Wiring for FPGAs", "category": 1}, {"name": "Estimating reliability and throughput of source-synchronous wave-pipelined interconnect", "category": 2}, {"name": "Reducing the Interconnection Network Cost of Chip Multiprocessors", "category": 2}, {"name": "Comparing tightly and loosely coupled mesochronous synchronizers in a NoC switch architecture", "category": 3}, {"name": "Configurable emulated shared memory architecture for general purpose MP-SOCs and NOC regions", "category": 1}, {"name": "Network Simplicity for Latency Insensitive Cores", "category": 4}, {"name": "Analytical modeling and evaluation of On-Chip Interconnects using Network Calculus", "category": 4}, {"name": "Scalability of network-on-chip communication architecture for 3-D meshes", "category": 5}, {"name": "Recursive partitioning multicast - A bandwidth-efficient routing for Networks-on-Chip", "category": 0}, {"name": "SEU-Hardened Energy Recovery Pipelined Interconnects for On-Chip Networks", "category": 2}, {"name": "Networks-on-chip in emerging interconnect paradigms - Advantages and challenges", "category": 2}, {"name": "Applying Dataflow Analysis to Dimension Buffers for Guaranteed Performance in Networks on Chip", "category": 4}, {"name": "Dual-Channel Access Mechanism for Cost-Effective NoC Design", "category": 1}, {"name": "Circuit-Switched Coherence", "category": 3}, {"name": "Real-Time Communication Analysis for On-Chip Networks with Wormhole Switching", "category": 5}, {"name": "Adding Slow-Silent Virtual Channels for Low-Power On-Chip Networks", "category": 2}, {"name": "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture", "category": 3}, {"name": "An Efficient Implementation of Distributed Routing Algorithms for NoCs", "category": 4}, {"name": "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms", "category": 0}, {"name": "Implementation of Wave-Pipelined Interconnects in FPGAs", "category": 6}, {"name": "A Lightweight Fault-Tolerant Mechanism for Network-on-Chip", "category": 4}, {"name": "Exploring High-Dimensional Topologies for NoC Design Through an Integrated Analysis and Synthesis Framework", "category": 6}, {"name": "A Design-for-Test Implementation of an Asynchronous Network-on-Chip Architecture and its Associated Test Pattern Generation and Application", "category": 5}, {"name": "Impact of Process and Temperature Variations on Network-on-Chip Design Exploration", "category": 2}, {"name": "An On-Chip and Inter-Chip Communications Network for the SpiNNaker Massively-Parallel Neural Net Simulator", "category": 0}, {"name": "Debugging Distributed-Shared-Memory Communication at Multiple Granularities in Networks on Chip", "category": 6}, {"name": "A Power and Energy Exploration of Network-on-Chip Architectures", "category": 0}, {"name": "A GALS many-core heterogeneous DSP platform with source-synchronous on-chip interconnection network", "category": 5}, {"name": "Low-Cost VC Allocator Design for Virtual Channel Wormhole Routers in Networks-on-Chip", "category": 3}, {"name": "A Hybrid Ring/Mesh Interconnect for Network-on-Chip Using Hierarchical Rings for Global Routing", "category": 2}, {"name": "A Generic Model for Formally Verifying NoC Communication Architectures - A Case Study", "category": 1}, {"name": "An Analytical Approach for Dimensioning Mixed Traffic Networks", "category": 3}, {"name": "The Power of Priority - NoC Based Distributed Cache Coherency", "category": 6}, {"name": "A Low-Latency and Low-Power Hybrid Insertion Methodology for Global Interconnects in VDSM Designs", "category": 0}, {"name": "Enabling Technology for On-Chip Interconnection Networks", "category": 4}, {"name": "NoC Communication Strategies Using Time-to-Digital Conversion", "category": 3}, {"name": "Transaction-Based Communication-Centric Debug", "category": 2}, {"name": "NOC-centric Security of Reconfigurable SoC", "category": 5}, {"name": "NoC - Network or Chip?", "category": 3}, {"name": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "category": 0}, {"name": "Low Power and Reliable Interconnection with Self-Corrected Green Coding Scheme for Network-on-Chip", "category": 6}, {"name": "Simulation and Evaluation of On-Chip Interconnect Architectures - 2D Mesh, Spidergon, and WK-Recursive Network", "category": 5}, {"name": "Analysis of photonic networks for a chip multiprocessor using scientific applications", "category": 1}, {"name": "ReNoC - A Network-on-Chip Architecture with Reconfigurable Topology", "category": 0}, {"name": "Implementation and Evaluation of a Dynamically Routed Processor Operand Network", "category": 4}, {"name": "QNoC Asynchronous Router with Dynamic Virtual Channel Allocation", "category": 3}, {"name": "NoC-Based FPGA - Architecture and Routing", "category": 1}, {"name": "Adaptive stochastic routing in fault-tolerant on-chip networks", "category": 4}, {"name": "Design Technologies for Networks on Chips", "category": 5}, {"name": "Towards Open Network-on-Chip Benchmarks", "category": 3}, {"name": "Architecture of the Scalable Communications Core", "category": 1}, {"name": "Implications of Rent's Rule for NoC Design and Its Fault-Tolerance", "category": 3}, {"name": "ASC, a SystemC Extension for Modeling Asynchronous Systems, and Its Application to an Asynchronous NoC", "category": 6}, {"name": "A New Binomial Mapping and Optimization Algorithm for Reduced-Complexity Mesh-Based On-Chip Network", "category": 3}, {"name": "Access Regulation to Hot-Modules in Wormhole NoCs", "category": 1}, {"name": "Mesh of Tree - Unifying Mesh and MFPGA for Better Device Performances", "category": 4}, {"name": "Region-Based Routing - An Efficient Routing Mechanism to Tackle Unreliable Hardware in Network on Chips", "category": 4}, {"name": "Approaching Ideal NoC Latency with Pre-Configured Routes", "category": 1}, {"name": "On Characterizing Performance of the Cell Broadband Engine Element Interconnect Bus", "category": 5}, {"name": "Fast, Accurate and Detailed NoC Simulations", "category": 0}, {"name": "Implementation of a Design-for-Test Architecture for Asynchronous Networks-on-Chip", "category": 1}, {"name": "A Study of NoC Exit Strategies", "category": 2}, {"name": "On the Design of a Photonic Network-on-Chip", "category": 4}, {"name": "Bi-Synchronous FIFO for Synchronous Circuit Communication Well Suited for Network-on-Chip in GALS Architectures", "category": 5}, {"name": "Implementing DSP Algorithms with On-Chip Networks", "category": 1}, {"name": "A Hybrid Analog-Digital Routing Network for NoC Dynamic Routing", "category": 2}, {"name": "Reflections on 10 Years as a Commercial On-Chip Interconnect Provider", "category": 4}, {"name": "The Impact of Higher Communication Layers on NoC Supported MP-SoCs", "category": 6}, {"name": "Reducing Interconnect Cost in NoC through Serialized Asynchronous Links", "category": 2}, {"name": "Thermal Impacts on NoC Interconnects", "category": 5}, {"name": "Dynamic Voltage and Frequency Scaling Architecture for Units Integration within a GALS NoC", "category": 6}, {"name": "NoC Design and Implementation in 65nm Technology", "category": 1}, {"name": "Solutions for Real Chip Implementation Issues of NoC and Their Application to Memory-Centric NoC", "category": 6}, {"name": "Distributed Sequencing for Resource Sharing in Multi-applicative Heterogeneous NoC Platforms", "category": 5}, {"name": "Invited Talk 1- Past, Present, and Future Communicating Processors", "category": 5}, {"name": "Invited Talk 2 - Optical Interconnects for Backplane and Chip-to-Chip Photonics", "category": 4}, {"name": "rdwired Networks on Chip in FPGAs to Unify Functional and Configuration Interconnects", "category": 1}, {"name": "Binary de Bruijn on-chip network for a flexible multiprocessor LDPC decoder.", "category": 6}, {"name": "An area-efficient high-throughput hybrid interconnection network for single-chip parallel processing.", "category": 5}, {"name": "A reconfigurable routing algorithm for a fault-tolerant 2D-Mesh Network-on-Chip.", "category": 3}, {"name": "A practical approach of memory access parallelization to exploit multiple off-chip DDR memories.", "category": 1}, {"name": "Variation-adaptive feedback control for networks-on-chip with multiple clock domains.", "category": 4}, {"name": "Application mapping for chip multiprocessors.", "category": 2}, {"name": "Concurrent topology and routing optimization in automotive network integration.", "category": 1}, {"name": "A dynamically-allocated virtual channel architecture with congestion awareness for on-chip routers.", "category": 5}, {"name": "DyAD - smart routing for networks-on-chip.", "category": 4}, {"name": "Operating-system controlled network on chip.", "category": 1}, {"name": "An efficient scalable and flexible data transfer architecture for multiprocessor SoC with massive distributed memory.", "category": 1}, {"name": "Design space exploration and prototyping for on-chip multimedia applications.", "category": 3}, {"name": "Statistical on-chip communication bus synthesis and voltage scaling under timing yield constraint.", "category": 0}, {"name": "Behavior and communication co-optimization for systems with sequential communication media.", "category": 6}, {"name": "Synthesis of high-performance packet processing pipelines.", "category": 6}, {"name": "Optimal link scheduling on improving best-effort and guaranteed services performance in network-on-chip systems.", "category": 3}, {"name": "Prediction-based flow control for network-on-chip traffic.", "category": 3}, {"name": "A multi-path routing strategy with guaranteed in-order packet delivery and fault-tolerance for networks on chip.", "category": 3}, {"name": "DyXY - a proximity congestion-aware deadlock-free dynamic routing method for network on chip.", "category": 2}, {"name": "O-Router - an optical routing framework for low power on-chip silicon nano-photonic integration.", "category": 6}, {"name": "Spectrum - a hybrid nanophotonic-electric on-chip network.", "category": 3}, {"name": "Exploring serial vertical interconnects for 3D ICs.", "category": 5}, {"name": "No cache-coherence - a single-cycle ring interconnection for multi-core L1-NUCA sharing on 3D chips.", "category": 2}, {"name": "NoC topology synthesis for supporting shutdown of voltage islands in SoCs.", "category": 4}, {"name": "Dynamic thread and data mapping for NoC based CMPs.", "category": 0}, {"name": "Cost-driven 3D integration with interconnect layers.", "category": 4}, {"name": "A multilayer nanophotonic interconnection network for on-chip many-core communications.", "category": 2}, {"name": "Virtual channels vs. multiple physical networks - a comparative analysis.", "category": 2}, {"name": "An efficient dynamically reconfigurable on-chip network architecture.", "category": 6}, {"name": "Networks on Chips - from research to products.", "category": 4}, {"name": "The aethereal network on chip after ten years - goals, evolution, lessons, and future.", "category": 2}, {"name": "The evolution of SOC interconnect and how NOC fits within it.", "category": 0}, {"name": "Automated modeling and emulation of interconnect designs for many-core chip multiprocessors.", "category": 5}, {"name": "Trace-driven optimization of networks-on-chip configurations.", "category": 4}, {"name": "ACES - application-specific cycle elimination and splitting for deadlock-free routing on irregular network-on-chip.", "category": 3}, {"name": "NTPT - on the end-to-end traffic prediction in the on-chip networks.", "category": 5}, {"name": "Application-aware NoC design for efficient SDRAM access.", "category": 1}, {"name": "Network on chip design and optimization using specialized influence models.", "category": 2}, {"name": "Crosstalk noise and bit error rate analysis for optical network-on-chip.", "category": 2}, {"name": "Fault and energy-aware communication mapping with guaranteed latency for applications implemented on NoC.", "category": 4}, {"name": "A low latency router supporting adaptivity for on-chip interconnects.", "category": 6}, {"name": "Floorplan-aware automated synthesis of bus-based communication architectures.", "category": 5}, {"name": "FLEXBUS - a high-performance system-on-chip communication architecture with a dynamically configurable topology.", "category": 5}, {"name": "Voltage-Frequency Island Partitioning for GALS-based Networks-on-Chip.", "category": 2}, {"name": "Introducing the SuperGT Network-on-Chip; SuperGT QoS - more than just GT.", "category": 5}, {"name": "Layered Switching for Networks on Chip.", "category": 5}, {"name": "Energy-Aware Synthesis of Networks-on-Chip Implemented with Voltage Islands.", "category": 1}, {"name": "The Case for Low-Power Photonic Networks on Chip.", "category": 3}, {"name": "Interconnect and Communication Synthesis for Distributed Register-File Microarchitecture.", "category": 6}, {"name": "Selective Band width and Resource Management in Scheduling for Dynamically Reconfigurable Architectures.", "category": 6}, {"name": "Quantum-Like Effects in Network-on-Chip Buffers Behavior.", "category": 3}, {"name": "Interconnects in the Third Dimension - Design Challenges for 3D ICs.", "category": 3}, {"name": "Performance Modeling and Optimization for Single- and Multi-Wall Carbon Nanotube Interconnects.", "category": 5}, {"name": "Micro-Photonic Interconnects - Characteristics, Possibilities and Limitations.", "category": 3}, {"name": "CAD Implications of New Interconnect Technologies.", "category": 3}], "links": [{"source": "Comparing Energy and Latency of Asynchronous and Synchronous NoCs for Embedded SoCs", "target": "A Low-Overhead Asynchronous Interconnection Network for GALS Chip Multiprocessors", "value": ""}, {"source": "A Low-Latency and Memory-Efficient On-chip Network", "target": "Application-aware NoC design for efficient SDRAM access.", "value": ""}, {"source": "Connection-centric network for spiking neural networks", "target": "Network-on-Chip Architectures for Neural Networks", "value": ""}, {"source": "A Communication and configuration controller for NoC based reconfigurable data flow architecture", "target": "Distributed Sequencing for Resource Sharing in Multi-applicative Heterogeneous NoC Platforms", "value": ""}, {"source": "Dynamic packet fragmentation for increased virtual channel utilization in on-chip routers", "target": "Fault-Tolerant Flow Control in On-chip Networks", "value": ""}, {"source": "Fault-tolerant architecture and deflection routing for degradable NoC switches", "target": "Addressing Manufacturing Challenges with Cost-Efficient Fault Tolerant Routing", "value": ""}, {"source": "Fault-tolerant architecture and deflection routing for degradable NoC switches", "target": "Fault-Tolerant Flow Control in On-chip Networks", "value": ""}, {"source": "Fault-tolerant architecture and deflection routing for degradable NoC switches", "target": "Transient and Permanent Error Co-management Method for Reliable Networks-on-Chip", "value": ""}, {"source": "BiNoC - A bidirectional NoC architecture with dynamic self-reconfigurable channel", "target": "Application-aware NoC design for efficient SDRAM access.", "value": ""}, {"source": "BiNoC - A bidirectional NoC architecture with dynamic self-reconfigurable channel", "target": "Application-aware NoC design for efficient SDRAM access.", "value": ""}, {"source": "Best of both worlds - A bus enhanced NoC (BENoC)", "target": "Best of both worlds - A bus enhanced NoC (BENoC)", "value": ""}, {"source": "Analysis of worst-case delay bounds for best-effort communication in wormhole networks on chip", "target": "Analysis of worst-case delay bounds for best-effort communication in wormhole networks on chip", "value": ""}, {"source": "Statistical Approach to NoC Design", "target": "Statistical Approach to NoC Design", "value": ""}, {"source": "Applying Dataflow Analysis to Dimension Buffers for Guaranteed Performance in Networks on Chip", "target": "Analytical modeling and evaluation of On-Chip Interconnects using Network Calculus", "value": ""}, {"source": "Circuit-Switched Coherence", "target": "Performance and power efficient on-chip communication using adaptive virtual point-to-point connections", "value": ""}, {"source": "Adding Slow-Silent Virtual Channels for Low-Power On-Chip Networks", "target": "Dynamic packet fragmentation for increased virtual channel utilization in on-chip routers", "value": ""}, {"source": "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture", "target": "NoC topology synthesis for supporting shutdown of voltage islands in SoCs.", "value": ""}, {"source": "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture", "target": "Comparing tightly and loosely coupled mesochronous synchronizers in a NoC switch architecture", "value": ""}, {"source": "An Efficient Implementation of Distributed Routing Algorithms for NoCs", "target": "Addressing Manufacturing Challenges with Cost-Efficient Fault Tolerant Routing", "value": ""}, {"source": "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms", "target": "Static virtual channel allocation in oblivious routing", "value": ""}, {"source": "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms", "target": "Physical-Aware Link Allocation and Route Assignment for Chip Multiprocessing", "value": ""}, {"source": "Exploring High-Dimensional Topologies for NoC Design Through an Integrated Analysis and Synthesis Framework", "target": "Network-on-Chip Architectures for Neural Networks", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "A Lightweight Fault-Tolerant Mechanism for Network-on-Chip", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "Adding Slow-Silent Virtual Channels for Low-Power On-Chip Networks", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "ReNoC - A Network-on-Chip Architecture with Reconfigurable Topology", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "Flow-aware allocation for on-chip networks", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "Dynamic packet fragmentation for increased virtual channel utilization in on-chip routers", "value": ""}, {"source": "A Power and Energy Exploration of Network-on-Chip Architectures", "target": "Network-on-Chip Architectures for Neural Networks", "value": ""}, {"source": "Low-Cost VC Allocator Design for Virtual Channel Wormhole Routers in Networks-on-Chip", "target": "Improved Utilization of NoC Channel Bandwidth by Switch Replication for Cost-Effective Multi-processor Systems-on-Chip", "value": ""}, {"source": "The Power of Priority - NoC Based Distributed Cache Coherency", "target": "Best of both worlds - A bus enhanced NoC (BENoC)", "value": ""}, {"source": "The Power of Priority - NoC Based Distributed Cache Coherency", "target": "Best of both worlds - A bus enhanced NoC (BENoC)", "value": ""}, {"source": "Enabling Technology for On-Chip Interconnection Networks", "target": "ReNoC - A Network-on-Chip Architecture with Reconfigurable Topology", "value": ""}, {"source": "Transaction-Based Communication-Centric Debug", "target": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "value": ""}, {"source": "Transaction-Based Communication-Centric Debug", "target": "Debugging Distributed-Shared-Memory Communication at Multiple Granularities in Networks on Chip", "value": ""}, {"source": "NOC-centric Security of Reconfigurable SoC", "target": "rdwired Networks on Chip in FPGAs to Unify Functional and Configuration Interconnects", "value": ""}, {"source": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "target": "Transaction-Based Communication-Centric Debug", "value": ""}, {"source": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "target": "Debugging Distributed-Shared-Memory Communication at Multiple Granularities in Networks on Chip", "value": ""}, {"source": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "target": "rdwired Networks on Chip in FPGAs to Unify Functional and Configuration Interconnects", "value": ""}, {"source": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "target": "Distributed Sequencing for Resource Sharing in Multi-applicative Heterogeneous NoC Platforms", "value": ""}, {"source": "Analysis of photonic networks for a chip multiprocessor using scientific applications", "target": "Performance Evaluation of a Multicore System with Optically Connected Memory Modules", "value": ""}, {"source": "Implementation and Evaluation of a Dynamically Routed Processor Operand Network", "target": "Recursive partitioning multicast - A bandwidth-efficient routing for Networks-on-Chip", "value": ""}, {"source": "QNoC Asynchronous Router with Dynamic Virtual Channel Allocation", "target": "QNoC Asynchronous Router with Dynamic Virtual Channel Allocation", "value": ""}, {"source": "NoC-Based FPGA - Architecture and Routing", "target": "rdwired Networks on Chip in FPGAs to Unify Functional and Configuration Interconnects", "value": ""}, {"source": "NoC-Based FPGA - Architecture and Routing", "target": "Statistical Approach to NoC Design", "value": ""}, {"source": "NoC-Based FPGA - Architecture and Routing", "target": "Static virtual channel allocation in oblivious routing", "value": ""}, {"source": "Implications of Rent's Rule for NoC Design and Its Fault-Tolerance", "target": "Flow-aware allocation for on-chip networks", "value": ""}, {"source": "Access Regulation to Hot-Modules in Wormhole NoCs", "target": "Flow-aware allocation for on-chip networks", "value": ""}, {"source": "Region-Based Routing - An Efficient Routing Mechanism to Tackle Unreliable Hardware in Network on Chips", "target": "An Efficient Implementation of Distributed Routing Algorithms for NoCs", "value": ""}, {"source": "Region-Based Routing - An Efficient Routing Mechanism to Tackle Unreliable Hardware in Network on Chips", "target": "Addressing Manufacturing Challenges with Cost-Efficient Fault Tolerant Routing", "value": ""}, {"source": "Approaching Ideal NoC Latency with Pre-Configured Routes", "target": "A Lightweight Fault-Tolerant Mechanism for Network-on-Chip", "value": ""}, {"source": "Implementation of a Design-for-Test Architecture for Asynchronous Networks-on-Chip", "target": "Dynamic Voltage and Frequency Scaling Architecture for Units Integration within a GALS NoC", "value": ""}, {"source": "Bi-Synchronous FIFO for Synchronous Circuit Communication Well Suited for Network-on-Chip in GALS Architectures", "target": "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture", "value": ""}, {"source": "Bi-Synchronous FIFO for Synchronous Circuit Communication Well Suited for Network-on-Chip in GALS Architectures", "target": "A modular synchronizing FIFO for NoCs", "value": ""}, {"source": "Bi-Synchronous FIFO for Synchronous Circuit Communication Well Suited for Network-on-Chip in GALS Architectures", "target": "Comparing tightly and loosely coupled mesochronous synchronizers in a NoC switch architecture", "value": ""}, {"source": "The Impact of Higher Communication Layers on NoC Supported MP-SoCs", "target": "Impact of Half-Duplex and Full-Duplex DMA Implementations on NoC Performance", "value": ""}, {"source": "Thermal Impacts on NoC Interconnects", "target": "Temperature-Aware Delay Borrowing for Energy-Efficient Low-Voltage Link Design", "value": ""}, {"source": "Thermal Impacts on NoC Interconnects", "target": "Lookahead-based adaptive voltage scheme for energy-efficient on-chip interconnect links", "value": ""}, {"source": "Dynamic Voltage and Frequency Scaling Architecture for Units Integration within a GALS NoC", "target": "A GALS many-core heterogeneous DSP platform with source-synchronous on-chip interconnection network", "value": ""}, {"source": "NoC Design and Implementation in 65nm Technology", "target": "Exploring High-Dimensional Topologies for NoC Design Through an Integrated Analysis and Synthesis Framework", "value": ""}, {"source": "NoC Design and Implementation in 65nm Technology", "target": "Physical Implementation of the DSPIN Network-on-Chip in the FAUST Architecture", "value": ""}, {"source": "NoC Design and Implementation in 65nm Technology", "target": "Improving the Performance of GALS-Based NoCs in the Presence of Process Variation", "value": ""}, {"source": "NoC Design and Implementation in 65nm Technology", "target": "Comparing Energy and Latency of Asynchronous and Synchronous NoCs for Embedded SoCs", "value": ""}, {"source": "NoC Design and Implementation in 65nm Technology", "target": "Improved Utilization of NoC Channel Bandwidth by Switch Replication for Cost-Effective Multi-processor Systems-on-Chip", "value": ""}, {"source": "Solutions for Real Chip Implementation Issues of NoC and Their Application to Memory-Centric NoC", "target": "Comparing tightly and loosely coupled mesochronous synchronizers in a NoC switch architecture", "value": ""}, {"source": "An area-efficient high-throughput hybrid interconnection network for single-chip parallel processing.", "target": "A Low-Overhead Asynchronous Interconnection Network for GALS Chip Multiprocessors", "value": ""}, {"source": "An area-efficient high-throughput hybrid interconnection network for single-chip parallel processing.", "target": "A Low-Overhead Asynchronous Interconnection Network for GALS Chip Multiprocessors", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Physical-Aware Link Allocation and Route Assignment for Chip Multiprocessing", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Fault-tolerant architecture and deflection routing for degradable NoC switches", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Design of Bandwidth Aware and Congestion Avoiding Efficient Routing Algorithms for Networks-on-Chip Platforms", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Approaching Ideal NoC Latency with Pre-Configured Routes", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "A Hybrid Analog-Digital Routing Network for NoC Dynamic Routing", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Layered Switching for Networks on Chip.", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Trade-offs in the Configuration of a Network on Chip for Multiple Use-Cases", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Solutions for Real Chip Implementation Issues of NoC and Their Application to Memory-Centric NoC", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "DyXY - a proximity congestion-aware deadlock-free dynamic routing method for network on chip.", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "A multi-path routing strategy with guaranteed in-order packet delivery and fault-tolerance for networks on chip.", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "Fault and energy-aware communication mapping with guaranteed latency for applications implemented on NoC.", "value": ""}, {"source": "DyAD - smart routing for networks-on-chip.", "target": "A low latency router supporting adaptivity for on-chip interconnects.", "value": ""}, {"source": "Prediction-based flow control for network-on-chip traffic.", "target": "Access Regulation to Hot-Modules in Wormhole NoCs", "value": ""}, {"source": "Fault and energy-aware communication mapping with guaranteed latency for applications implemented on NoC.", "target": "NoC Design and Implementation in 65nm Technology", "value": ""}, {"source": "Floorplan-aware automated synthesis of bus-based communication architectures.", "target": "NoC topology synthesis for supporting shutdown of voltage islands in SoCs.", "value": ""}, {"source": "FLEXBUS - a high-performance system-on-chip communication architecture with a dynamically configurable topology.", "target": "Trace-driven optimization of networks-on-chip configurations.", "value": ""}, {"source": "Energy-Aware Synthesis of Networks-on-Chip Implemented with Voltage Islands.", "target": "NoC topology synthesis for supporting shutdown of voltage islands in SoCs.", "value": ""}, {"source": "Interconnects in the Third Dimension - Design Challenges for 3D ICs.", "target": "Analysis of photonic networks for a chip multiprocessor using scientific applications", "value": ""}, {"source": "Interconnects in the Third Dimension - Design Challenges for 3D ICs.", "target": "Exploring serial vertical interconnects for 3D ICs.", "value": ""}]}